'''1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод
__init__()), который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде
прямоугольной схемы.

Примеры матриц: 3 на 2,     3 на 3,     2 на 4.
                31 22       3 5 32      3 5 8 3
                37 43       2 4 6       3 5 8 3
                51 86       -1 64 -8

Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном
виде.
Далее реализовать перегрузку метода __add__() для сложения двух объектов класса Matrix
(двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно. Первый элемент первой
строки первой матрицы складываем с первым элементом первой строки второй матрицы и пр.
'''


class Matrix:
    def __init__(self, lists):
        self.lists = lists

    def __str__(self):
        return '\n'.join(map(str, self.lists))

    def __add__(self, other):
        c = []
        for i in range(len(self.lists)):
            c.append([])
            for j in range(len(self.lists[0])):
                c[i].append(self.lists[i][j] + other.lists[i][j])
        return '\n'.join(map(str, c))


a = [[31, 22], [37, 43], [51, 86]]
b = [[69, 78], [63, 57], [49, 14]]

neo = Matrix(a)
trinity = Matrix(b)
love = neo + trinity
print(f"Matrix 1\n{neo}\n")
print(f"Matrix 2\n{trinity}\n")
print(f"Matrix Total\n{love}\n")