'''2. Создать собственный класс-исключение, обрабатывающий ситуацию деления на ноль.
Проверить его работу на данных, вводимых пользователем. При вводе нуля в качестве
делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.'''

class Div_0:

    def __init__(self, a, b):
        self.a = a
        self.b = b

    @staticmethod
    def div_0(a, b):
        try:
            return (a / b)
        except:
            return (f"Ошибка ДЕЛ/0!")


div = Div_0(1, 2)
print(div.div_0(1, 0))
print(Div_0.div_0(1, 0))
print(Div_0.div_0(5, 2))