'''
1. Реализовать вывод информации о промежутке времени в зависимости от его продолжительности
duration в секундах:
до минуты: <s> сек;
до часа: <m> мин <s> сек;
до суток: <h> час <m> мин <s> сек;
* в остальных случаях: <d> дн <h> час <m> мин <s> сек.
Примеры:

duration = 53
53 сек
duration = 153
2 мин 33 сек
duration = 4153
1 час 9 мин 13 сек
duration = 400153
4 дн 15 час 9 мин 13 сек

Примечание: можете проверить себя здесь, подумайте, можно ли использовать цикл для проверки работы кода
сразу для нескольких значений продолжительности, будет ли тут полезен список?
'''

#  Вариант_1
duration = int(input('Insert duration (sec): '))
print(f'duration = {duration} \n')
#day = 86400 sec
day = duration//86400
#hour = 3600 sec
hour = duration%86400//3600
#min = 60 sec
min = duration%86400%3600//60
#sec = sec
sec = duration%86400%3600%60
#Вывод на экран:
print(f'{day} дн {hour} час {min} мин {sec} сек')

#Вариант_2
print(f'{duration//86400} дн '
      f'{duration%86400//3600} час '
      f'{duration%86400%3600//60} мин '
      f'{duration%86400%3600%60} сек')

#Проверка цилом
durations = [53, 153, 4153, 400153]
print(f'\n Проверка циклом списка значений: \n{durations}')
for duration in durations:
      print(f'{duration // 86400} дн '
            f'{duration % 86400 // 3600} час '
            f'{duration % 86400 % 3600 // 60} мин '
            f'{duration % 86400 % 3600 % 60} сек')