'''Дан список, содержащий искажённые данные с должностями и именами сотрудников:
    ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
Известно, что имя сотрудника всегда в конце строки. Сформировать из этих имён и вывести на
экран фразы вида: 'Привет, Игорь!' Подумать, как получить имена сотрудников из элементов
списка, как привести их к корректному виду. Можно ли при этом не создавать новый список?'''

employees_list = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']

for employees_str in employees_list:
    employees_str = employees_str.lower()           # все буквы в Строке в нижнем регистре
    empl_list = employees_str.split()               # Список из слов из Строки
    empl_name = empl_list [-1]                      # обращение к последнему эл-ту из Списка
    print(f'Привет, {empl_name.capitalize()}!')