'''Создать вручную список, содержащий цены на товары (10–20 товаров), например:
    [57.8, 46.51, 97, ...]
A. Вывести на экран эти цены через запятую в одну строку, цена должна отображаться в виде
    <r> руб <kk> коп (например «5 руб 04 коп»). Подумать, как из цены получить рубли и копейки,
    как добавить нули, если, например, получилось 7 копеек или 0 копеек (должно быть 07 коп
    или 00 коп).
B. Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что
    объект списка после сортировки остался тот же).
C. Создать новый список, содержащий те же цены, но отсортированные по убыванию.
D. Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по
    возрастанию, написав минимум кода?'''



price_list = [57.8, 1.02, 46.51, 97, 45, 58.5, 154.89, 50, 69.35, 78.89, 54.89, 155, 256, 1000, 68.26, 523.76, 56.25, 1.02, 3.05, 54.25, 48.35]

#A.
price_str = ''
for price in price_list:
    if isinstance(price, float):
        price = str(price)
        rub, kop = price.split('.')
        if len(kop) == 1:               #проверка на то, что цифра в коп одна
            kop = kop + '0'             #добавление "0" после цифры
    elif isinstance(price, int):
        rub = price
        kop = '00'
    price_1 = (f'{rub} руб {kop} коп, ')
    price_str += price_1
print(f'А. \n{price_str}')

#B. Вывести цены, отсортированные по возрастанию, новый список не создавать (доказать, что объект списка после сортировки остался тот же).
print(f'B. \nID: {id(price_list)} {price_list}')
price_list.sort()
print(f'ID: {id(price_list)} {price_list}')

#C. Создать новый список, содержащий те же цены, но отсортированные по убыванию.
print(f'C. \nID: {id(price_list)} {price_list}')
price_list_new = list(reversed(price_list))
print(f'ID: {id(price_list_new)} {price_list_new}')

#D. Вывести цены пяти самых дорогих товаров. Сможете ли вывести цены этих товаров по возрастанию, написав минимум кода?
print('D.')
print(list(sorted(price_list, reverse=True))[:5])