"""
3. Написать функцию thesaurus(), принимающую в качестве аргументов имена сотрудников и
возвращающую словарь, в котором ключи — первые буквы имён, а значения — списки,
содержащие имена, начинающиеся с соответствующей буквы. Например:

#    >>> thesaurus("Иван", "Мария", "Петр", "Илья")
{
    "И": ["Иван", "Илья"],
    "М": ["Мария"],
    "П": ["Петр"]
}

Подумайте: полезен ли будет вам оператор распаковки? Как поступить, если потребуется
сортировка по ключам? Можно ли использовать словарь в этом случае?
"""

"""
def thesaurus(name):
    a = name.strip('"')#.split('/')
    return a


name = "Иван", "Мария", "Петр", "Илья"
print(thesaurus(name))
"""

def thesaurus(name):
    name_dict = {}
    for i in name:
        name_dict.setdefault(i.split()[-1][0], []).append(i)
    return name_dict

name = ["Иван", "Мария", "Петр", "Илья"]
print(thesaurus(name))